# ----------
# Задача 2
# Разпределение - дава се графика и трябва да кажем какво е.

### --- Равномерно разпределение

# runif - равномерно разпределение - хвърляне на зар
# Каква е вероятнастта да се падне от 1 до 4
punif(4, 1, 6)

# Random generator - равномерно разпределение

# Вероятността да е по малко от 3
punif(3, 1, 6)

# Вероятността да е по-голямо от 3
punif(3, 1, 6)
punif(3, a, b) # a, b интервал

### --- Нормално разпределение
pnorm(q, mean, sd)
?pnorm(1, 5, 5)

### --- Експоненциално разпределение
# - ползваме го когато имаме време
pexp()

### --- Биномно разпределение
# брой успехи от n опита, които са независими

### --- Геометрично разпределение
# Броят на неуспехите при настъпване на първия успех

### --- Поасоново разпределение
# Часови интервал - от 1 до 3 и в тоя интервал колко събития ще се случат

### --- Бернулиевото 
# - частен случаи на биномното n=1

### --- Отрицателно биномно 
# - като геометрично - колко неуспеха до настъпване на 3 успеха
